In [132]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20,10)

In [133]:
df1=pd.read_csv("E:\Data\Bengaluru_House_Data.csv")

In [134]:
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [135]:
df1.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [136]:
df1.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [137]:
df2=df1.drop(["area_type","society","balcony","availability"],axis='columns')
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [138]:
df2['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', nan, '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [139]:
size=df2['size'].str.split(" ", n = 1, expand = True)  
df2['BHK']=size[0]

df2["BHK"] = df2.BHK.astype(float)

In [140]:
df2.dtypes

location       object
size           object
total_sqft     object
bath          float64
price         float64
BHK           float64
dtype: object

In [141]:
df2.head()

                   location       size total_sqft  bath   price  BHK
0  Electronic City Phase II      2 BHK       1056   2.0   39.07  2.0
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00  4.0
2               Uttarahalli      3 BHK       1440   2.0   62.00  3.0
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00  3.0
4                  Kothanur      2 BHK       1200   2.0   51.00  2.0

In [142]:
df3=df2.drop(["size"],axis=1)
df3.head()

                   location total_sqft  bath   price  BHK
0  Electronic City Phase II       1056   2.0   39.07  2.0
1          Chikka Tirupathi       2600   5.0  120.00  4.0
2               Uttarahalli       1440   2.0   62.00  3.0
3        Lingadheeranahalli       1521   3.0   95.00  3.0
4                  Kothanur       1200   2.0   51.00  2.0

In [143]:
df3['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [144]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [145]:
df3[~df3['total_sqft'].apply(is_float)]

                 location   total_sqft  bath    price  BHK
30              Yelahanka  2100 - 2850   4.0  186.000  4.0
56            Devanahalli  3010 - 3410   NaN  192.000  4.0
81            Hennur Road  2957 - 3450   NaN  224.500  4.0
122                Hebbal  3067 - 8156   4.0  477.000  4.0
137    8th Phase JP Nagar  1042 - 1105   2.0   54.005  2.0
...                   ...          ...   ...      ...  ...
12990      Talaghattapura  1804 - 2273   3.0  122.000  3.0
13059              Harlur  1200 - 1470   2.0   72.760  2.0
13240         Devanahalli  1020 - 1130   NaN   52.570  1.0
13265               Hoodi  1133 - 1384   2.0   59.135  2.0
13299          Whitefield  2830 - 2882   5.0  154.500  4.0

[247 rows x 5 columns]

In [146]:
# col_30=df3['total_sqft'].values[30]
# tokens=col_30.split('-')
# print(tokens)   OUTPUT: ['2100 ', ' 2850']
# print(len(tokens))    OUTPUT: 2

In [147]:
def convert_sqft_to_num(x):
    tokens=x.split('-')
    if len(tokens) == 2:
        return(float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [148]:
df3['total_sqft'] = df3['total_sqft'].apply(convert_sqft_to_num)

In [149]:
df3.head()

                   location  total_sqft  bath   price  BHK
0  Electronic City Phase II      1056.0   2.0   39.07  2.0
1          Chikka Tirupathi      2600.0   5.0  120.00  4.0
2               Uttarahalli      1440.0   2.0   62.00  3.0
3        Lingadheeranahalli      1521.0   3.0   95.00  3.0
4                  Kothanur      1200.0   2.0   51.00  2.0

In [150]:
df3["price_per_square_feet"]=df3["price"]*100000/df3["total_sqft"]

In [151]:
df3.head()

,location,total_sqft,bath,price,BHK,price_per_square_feet
0,Electronic City Phase II,1056.0,2.0,39.07,2.0,3699.810606
1,Chikka Tirupathi,2600.0,5.0,120.00,4.0,4615.384615
2,Uttarahalli,1440.0,2.0,62.00,3.0,4305.555556
3,Lingadheeranahalli,1521.0,3.0,95.00,3.0,6245.890861
4,Kothanur,1200.0,2.0,51.00,2.0,4250.000000

In [152]:
location_stats = df3.groupby("location").location.agg("count").sort_values(ascending=False)
location_below_10=location_stats[location_stats<=10]

In [153]:
location_stats

location
Whitefield                              540
Sarjapur  Road                          399
Electronic City                         302
Kanakpura Road                          273
Thanisandra                             234
                                       ...
Kodanda Reddy Layout                      1
Kirloskar layout, Basaveshwarnagar        1
Kengeri Satellite Town Stage II           1
Kengeri Satellite Town KHB Apartment      1
 Anekal                                   1
Name: location, Length: 1305, dtype: int64

In [154]:
location_below_10

location
BTM 1st Stage                           10
Basapura                                10
Ganga Nagar                             10
1st Block Koramangala                   10
Dodsworth Layout                        10
                                        ..
Kodanda Reddy Layout                     1
Kirloskar layout, Basaveshwarnagar       1
Kengeri Satellite Town Stage II          1
Kengeri Satellite Town KHB Apartment     1
 Anekal                                  1
Name: location, Length: 1064, dtype: int64

In [155]:
len(df3.location.unique())

1306

In [156]:
df3["location"]=df3["location"].apply(lambda x: 'other' if x in location_below_10 else x)

In [157]:
df3.head(10)

,location,total_sqft,bath,price,BHK,price_per_square_feet
0,Electronic City Phase II,1056.0,2.0,39.07,2.0,3699.810606
1,Chikka Tirupathi,2600.0,5.0,120.00,4.0,4615.384615
2,Uttarahalli,1440.0,2.0,62.00,3.0,4305.555556
3,Lingadheeranahalli,1521.0,3.0,95.00,3.0,6245.890861
4,Kothanur,1200.0,2.0,51.00,2.0,4250.000000
5,Whitefield,1170.0,2.0,38.00,2.0,3247.863248
6,Old Airport Road,2732.0,4.0,204.00,4.0,7467.057101
7,Rajaji Nagar,3300.0,4.0,600.00,4.0,18181.818182
8,Marathahalli,1310.0,3.0,63.25,3.0,4828.244275
9,other,1020.0,6.0,370.00,6.0,36274.509804

In [158]:
len(df3.location.unique())

243

In [159]:
df3.shape

(13320, 6)

In [161]:
df4=df3[~(df3.total_sqft/df3.BHK<300)]
df4.shape

(12576, 6)

In [163]:
df4.price_per_square_feet.describe()

count     12530.000000
mean       6303.979357
std        4162.237981
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_square_feet, dtype: float64

In [168]:
def remove_pps_outliers(df):
    df_out = pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m=np.mean(subdf.price_per_square_feet)
        st=np.std(subdf.price_per_square_feet)
        reduced_df = subdf[(subdf.price_per_square_feet>(m-st)) & (subdf.price_per_square_feet<=(m+st))]
        df_out = pd.concat([df_out,reduced_df], ignore_index=True)
    return df_out

In [169]:
df5=remove_pps_outliers(df4)
df5.shape

(10303, 6)

In [171]:
df5.bath.unique()

array([ 2.,  3.,  4.,  5.,  8.,  1.,  6., nan,  7.,  9., 12., 16., 13.])

In [172]:
df5 = df5.dropna(how='all')

##### df5.bath.unique()